html/index.html
<!DOCTYPE html>
<html>
<head>
<title>Kaushik Kulkarni</title>
<!-- 2019-02-27 Wed 00:48 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Kaushik Kulkarni">
<link rel="stylesheet" type="text/css" href="css/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Kaushik Kulkarni</h1>
<p>
I am a second year PhD student at University of Illinois at
Urbana-Champaign, where I am a part of the
<a href="http://scicomp.cs.illinois.edu/">Scientific Computing group</a> in the
Computer Science Department. I am advised by
<a href="https://andreask.cs.illinois.edu/">Prof. Andreas Klöckner</a> with whom
I am working in the area of <i>Transformation based Code Generation</i> in
applications motivated by Finite element methods.
</p>

<p>
Before starting out as a PhD Student, I was an undergraduate student at
Indian Institute of Technology at Bombay, where I worked on topics
related to Computational Fluid Dynamics.
</p>

<hr >

<p>
To know more about me please visit &#x2013;
</p>

<ul class="org-ul">
<li><a href="research.html">My research</a>
</li>
<li><a href="publications.html">Publications</a>
</li>
<li><a href="talks.html">Talks</a>
</li>
<li><a href="extras/resume.pdf">My CV</a>
</li>
<li><a href="https://github.com/kaushikcfd/">My GitHub profile</a>
</li>
<li><a href="blog.html">Random musings</a>  
</li>
</ul>

<hr >

<p>
<b>Contact:</b> <a href="mailto:kgk2@illinois.edu">kgk2@illinois.edu</a>
</p>

<hr >
</div>
<div id="postamble" class="status">
<p class="creator">Last Updated 2019-02-27 Wed 00:48.</p>
</div>
</body>
</html>
